// Отркывает сайт в зависимости от версии 1С 8.2 или 8.3
&НаКлиенте
Процедура ОткрытьСайт(ИмяСайта)
	
	Попытка
		Выполнить("НачатьЗапускПриложения(,ИмяСайта)");
	Исключение
		ЗапуститьПриложение(ИмяСайта);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСайтАвтора(Команда)
	
	ОткрытьСайт(СайтАвтора);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СайтАвтора") Тогда
		СайтАвтора = Параметры.СайтАвтора;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстПриОбновлении") Тогда
		HTML.УстановитьHTML(Параметры.ТекстПриОбновлении, Новый Структура);
	КонецЕсли;
	
	Если Параметры.Свойство("КоличествоОбновлений") Тогда
		ЭтаФорма.Заголовок = ?(Параметры.КоличествоОбновлений > 1, 
			"Обнаружены новые версии!",
			"Обнаружена новая версия!");
	КонецЕсли;                  
	
	
КонецПроцедуры
